<?xml version="1.0"?>
<CastXML format="1.4.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22"/>
  <Typedef id="_2" name="__int128_t" type="_23" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_24" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_25" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_26" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_27" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="Bar" context="_1" location="f1:1" file="f1" line="1" members="_28" size="32" align="32"/>
  <Namespace id="_8" name="Foo" context="_1" members="_29 _30 _31 _32"/>
  <Namespace id="_9" name="std" context="_1"/>
  <OperatorFunction id="_10" name="new" returns="_33" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_Znwm">
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_11" name="new" returns="_33" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZnwmSt11align_val_t">
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_12" name="new[]" returns="_33" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_Znam">
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_13" name="new[]" returns="_33" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZnamSt11align_val_t">
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_14" name="delete" returns="_36" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPv">
    <Argument type="_33" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_15" name="delete" returns="_36" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPvSt11align_val_t">
    <Argument type="_33" location="f0:0" file="f0" line="0"/>
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_16" name="delete" returns="_36" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPvm">
    <Argument type="_33" location="f0:0" file="f0" line="0"/>
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_17" name="delete" returns="_36" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPvmSt11align_val_t">
    <Argument type="_33" location="f0:0" file="f0" line="0"/>
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_18" name="delete[]" returns="_36" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPv">
    <Argument type="_33" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_19" name="delete[]" returns="_36" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPvSt11align_val_t">
    <Argument type="_33" location="f0:0" file="f0" line="0"/>
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_20" name="delete[]" returns="_36" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPvm">
    <Argument type="_33" location="f0:0" file="f0" line="0"/>
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_21" name="delete[]" returns="_36" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPvmSt11align_val_t">
    <Argument type="_33" location="f0:0" file="f0" line="0"/>
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <Function id="_22" name="sum" returns="_37" context="_1" location="f2:40" file="f2" line="40" mangled="_Z3sumff">
    <Argument name="a" type="_37" location="f2:40" file="f2" line="40"/>
    <Argument name="b" type="_37" location="f2:40" file="f2" line="40"/>
  </Function>
  <FundamentalType id="_23" name="__int128" size="128" align="128"/>
  <FundamentalType id="_24" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_25" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_38 _39 _40 _41" size="256" align="64"/>
  <PointerType id="_26" type="_42" size="64" align="64"/>
  <ArrayType id="_27" min="0" max="0" type="_43"/>
  <Field id="_28" name="_3" type="_44" context="_7" access="public" location="f1:2" file="f1" line="2" offset="0"/>
  <Class id="_29" name="Test&lt;Bar&gt;" context="_8" location="f1:8" file="f1" line="8" members="_45 _46 _47 _48 _49 _50 _51 _52 _53 _54" size="256" align="64"/>
  <Class id="_30" name="Test&lt;int&gt;" context="_8" location="f1:8" file="f1" line="8" incomplete="1"/>
  <Class id="_31" name="Test2" context="_8" location="f1:23" file="f1" line="23" members="_55 _56 _57 _58 _59" bases="_29" size="256" align="64">
    <Base type="_29" access="public" virtual="0" offset="0"/>
  </Class>
  <Function id="_32" name="sum" returns="_37" context="_8" location="f1:29" file="f1" line="29" mangled="_ZN3Foo3sumEff">
    <Argument name="a" type="_37" location="f1:29" file="f1" line="29"/>
    <Argument name="b" type="_37" location="f1:29" file="f1" line="29"/>
  </Function>
  <PointerType id="_33" type="_36" size="64" align="64"/>
  <FundamentalType id="_34" name="long unsigned int" size="64" align="64"/>
  <Enumeration id="_35" name="align_val_t" type="_34" context="_9" location="f0:0" file="f0" line="0" scoped="1" size="64" align="64"/>
  <FundamentalType id="_36" name="void" size="0" align="8"/>
  <FundamentalType id="_37" name="float" size="32" align="32"/>
  <Field id="_38" name="isa" type="_60" context="_25" access="public" offset="0"/>
  <Field id="_39" name="flags" type="_44" context="_25" access="public" offset="64"/>
  <Field id="_40" name="str" type="_61" context="_25" access="public" offset="128"/>
  <Field id="_41" name="length" type="_62" context="_25" access="public" offset="192"/>
  <Struct id="_43" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_63 _64 _65 _66" size="192" align="64"/>
  <FundamentalType id="_44" name="int" size="32" align="32"/>
  <Method id="_45" name="testingFunction" returns="_36" context="_29" access="public" location="f1:10" file="f1" line="10" virtual="1" mangled="_ZN3Foo4TestI3BarE15testingFunctionEf">
    <Argument name="delta" type="_37" location="f1:10" file="f1" line="10"/>
  </Method>
  <Field id="_46" name="testingItem" type="_44" context="_29" access="public" location="f1:12" file="f1" line="12" offset="64"/>
  <Field id="_47" name="testingptr" type="_67" context="_29" access="public" location="f1:13" file="f1" line="13" offset="128"/>
  <Field id="_48" name="testingChar" type="_42" context="_29" access="public" location="f1:14" file="f1" line="14" offset="192"/>
  <FundamentalType id="_42" name="char" size="8" align="8"/>
  <Destructor id="_49" name="Test" context="_29" access="public" location="f1:16" file="f1" line="16" virtual="1"/>
  <Method id="_50" name="fizzbuzzFunc" returns="_68" context="_29" access="public" location="f1:17" file="f1" line="17" inline="1" mangled="_ZN3Foo4TestI3BarE12fizzbuzzFuncEi">
    <Argument type="_44" location="f1:17" file="f1" line="17"/>
  </Method>
  <Constructor id="_51" name="Test" context="_29" access="public" location="f1:19" file="f1" line="19"/>
  <Constructor id="_52" name="Test" context="_29" access="public" location="f1:20" file="f1" line="20">
    <Argument name="i" type="_44" location="f1:20" file="f1" line="20"/>
  </Constructor>
  <OperatorMethod id="_53" name="=" returns="_69" context="_29" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1" mangled="_ZN3Foo4TestI3BarEaSERKS2_">
    <Argument type="_70" location="f1:8" file="f1" line="8"/>
  </OperatorMethod>
  <Constructor id="_54" name="Test" context="_29" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1">
    <Argument type="_70" location="f1:8" file="f1" line="8"/>
  </Constructor>
  <Method id="_55" name="testingFunction" returns="_36" context="_31" access="private" location="f1:24" file="f1" line="24" virtual="1" overrides="_45" mangled="_ZN3Foo5Test215testingFunctionEf" attributes="override">
    <Argument name="delta" type="_37" location="f1:24" file="f1" line="24"/>
  </Method>
  <Constructor id="_56" name="Test2" context="_31" access="private" location="f1:25" file="f1" line="25"/>
  <Destructor id="_57" name="Test2" context="_31" access="private" location="f1:26" file="f1" line="26" virtual="1" overrides="_49"/>
  <Constructor id="_58" name="Test2" context="_31" access="public" location="f1:23" file="f1" line="23" inline="1" artificial="1">
    <Argument type="_71" location="f1:23" file="f1" line="23"/>
  </Constructor>
  <OperatorMethod id="_59" name="=" returns="_72" context="_31" access="public" location="f1:23" file="f1" line="23" inline="1" artificial="1" mangled="_ZN3Foo5Test2aSERKS0_">
    <Argument type="_71" location="f1:23" file="f1" line="23"/>
  </OperatorMethod>
  <PointerType id="_60" type="_44c" size="64" align="64"/>
  <CvQualifiedType id="_44c" type="_44" const="1"/>
  <PointerType id="_61" type="_42c" size="64" align="64"/>
  <CvQualifiedType id="_42c" type="_42" const="1"/>
  <FundamentalType id="_62" name="long int" size="64" align="64"/>
  <Field id="_63" name="gp_offset" type="_68" context="_43" access="public" offset="0"/>
  <Field id="_64" name="fp_offset" type="_68" context="_43" access="public" offset="32"/>
  <Field id="_65" name="overflow_arg_area" type="_33" context="_43" access="public" offset="64"/>
  <Field id="_66" name="reg_save_area" type="_33" context="_43" access="public" offset="128"/>
  <PointerType id="_67" type="_44" size="64" align="64"/>
  <FundamentalType id="_68" name="unsigned int" size="32" align="32"/>
  <ReferenceType id="_69" type="_29" size="64" align="64"/>
  <ReferenceType id="_70" type="_29c" size="64" align="64"/>
  <CvQualifiedType id="_29c" type="_29" const="1"/>
  <ReferenceType id="_71" type="_31c" size="64" align="64"/>
  <CvQualifiedType id="_31c" type="_31" const="1"/>
  <ReferenceType id="_72" type="_31" size="64" align="64"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="test/test.hpp"/>
  <File id="f2" name="test/test.cpp"/>
</CastXML>
