<?xml version="1.0"?>
<CastXML format="1.4.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8"/>
  <Typedef id="_2" name="__int128_t" type="_9" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="Bar" context="_1" location="f1:1" file="f1" line="1" members="_14 _15 _16 _17 _18 _19 _20" size="32" align="32"/>
  <Namespace id="_8" name="Foo" context="_1" members="_21 _22 _23"/>
  <FundamentalType id="_9" name="__int128" size="128" align="128"/>
  <FundamentalType id="_10" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_11" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_24 _25 _26 _27" size="256" align="64"/>
  <PointerType id="_12" type="_28" size="64" align="64"/>
  <ArrayType id="_13" min="0" max="0" type="_29"/>
  <Field id="_14" name="_3" type="_30" context="_7" access="public" location="f1:2" file="f1" line="2" offset="0"/>
  <Constructor id="_15" name="Bar" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_16" name="Bar" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_31" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_17" name="=" returns="_32" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="_ZN3BaraSERKS_">
    <Argument type="_31" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Constructor id="_18" name="Bar" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_33" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_19" name="=" returns="_32" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="_ZN3BaraSEOS_">
    <Argument type="_33" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_20" name="Bar" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Class id="_21" name="Test&lt;Bar&gt;" context="_8" location="f1:8" file="f1" line="8" members="_34 _35 _36 _37 _38 _39 _40 _41 _42 _43" size="256" align="64"/>
  <Class id="_22" name="Test2" context="_8" location="f1:23" file="f1" line="23" members="_44 _45 _46 _47 _48" bases="_21" size="256" align="64">
    <Base type="_21" access="public" virtual="0" offset="0"/>
  </Class>
  <Function id="_23" name="sum" returns="_49" context="_8" location="f1:30" file="f1" line="30" mangled="_ZN3Foo3sumEff">
    <Argument name="a" type="_49" location="f1:30" file="f1" line="30"/>
    <Argument name="b" type="_49" location="f1:30" file="f1" line="30"/>
  </Function>
  <Field id="_24" name="isa" type="_50" context="_11" access="public" offset="0"/>
  <Field id="_25" name="flags" type="_30" context="_11" access="public" offset="64"/>
  <Field id="_26" name="str" type="_51" context="_11" access="public" offset="128"/>
  <Field id="_27" name="length" type="_52" context="_11" access="public" offset="192"/>
  <Struct id="_29" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_53 _54 _55 _56" size="192" align="64"/>
  <FundamentalType id="_30" name="int" size="32" align="32"/>
  <ReferenceType id="_31" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_32" type="_7" size="64" align="64"/>
  <RValueReferenceType id="_33" type="_7" size="64" align="64"/>
  <Method id="_34" name="testingFunction" returns="_57" context="_21" access="public" location="f1:10" file="f1" line="10" virtual="1" mangled="_ZN3Foo4TestI3BarE15testingFunctionEd">
    <Argument name="delta" type="_58" location="f1:10" file="f1" line="10"/>
  </Method>
  <Field id="_35" name="testingItem" type="_30" context="_21" access="public" location="f1:12" file="f1" line="12" offset="64"/>
  <Field id="_36" name="testingptr" type="_59" context="_21" access="public" location="f1:13" file="f1" line="13" offset="128"/>
  <Field id="_37" name="testingChar" type="_28" context="_21" access="public" location="f1:14" file="f1" line="14" offset="192"/>
  <FundamentalType id="_28" name="char" size="8" align="8"/>
  <Destructor id="_38" name="Test" context="_21" access="public" location="f1:16" file="f1" line="16"/>
  <Method id="_39" name="test" returns="_57" context="_21" access="public" location="f1:17" file="f1" line="17" const="1" mangled="_ZNK3Foo4TestI3BarE4testEv"/>
  <Constructor id="_40" name="Test" context="_21" access="public" location="f1:19" file="f1" line="19"/>
  <Constructor id="_41" name="Test" context="_21" access="public" location="f1:20" file="f1" line="20">
    <Argument name="i" type="_30" location="f1:20" file="f1" line="20"/>
  </Constructor>
  <OperatorMethod id="_42" name="=" returns="_60" context="_21" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1" mangled="_ZN3Foo4TestI3BarEaSERKS2_">
    <Argument type="_61" location="f1:8" file="f1" line="8"/>
  </OperatorMethod>
  <Constructor id="_43" name="Test" context="_21" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1">
    <Argument type="_61" location="f1:8" file="f1" line="8"/>
  </Constructor>
  <Method id="_44" name="testingFunction" returns="_57" context="_22" access="public" location="f1:25" file="f1" line="25" virtual="1" overrides="_34" mangled="_ZN3Foo5Test215testingFunctionEd" attributes="override">
    <Argument name="delta" type="_58" location="f1:25" file="f1" line="25"/>
  </Method>
  <Constructor id="_45" name="Test2" context="_22" access="public" location="f1:26" file="f1" line="26"/>
  <Destructor id="_46" name="Test2" context="_22" access="public" location="f1:27" file="f1" line="27"/>
  <Constructor id="_47" name="Test2" context="_22" access="public" location="f1:23" file="f1" line="23" inline="1" artificial="1">
    <Argument type="_62" location="f1:23" file="f1" line="23"/>
  </Constructor>
  <OperatorMethod id="_48" name="=" returns="_63" context="_22" access="public" location="f1:23" file="f1" line="23" inline="1" artificial="1" mangled="_ZN3Foo5Test2aSERKS0_">
    <Argument type="_62" location="f1:23" file="f1" line="23"/>
  </OperatorMethod>
  <FundamentalType id="_49" name="float" size="32" align="32"/>
  <PointerType id="_50" type="_30c" size="64" align="64"/>
  <CvQualifiedType id="_30c" type="_30" const="1"/>
  <PointerType id="_51" type="_28c" size="64" align="64"/>
  <CvQualifiedType id="_28c" type="_28" const="1"/>
  <FundamentalType id="_52" name="long int" size="64" align="64"/>
  <Field id="_53" name="gp_offset" type="_64" context="_29" access="public" offset="0"/>
  <Field id="_54" name="fp_offset" type="_64" context="_29" access="public" offset="32"/>
  <Field id="_55" name="overflow_arg_area" type="_65" context="_29" access="public" offset="64"/>
  <Field id="_56" name="reg_save_area" type="_65" context="_29" access="public" offset="128"/>
  <FundamentalType id="_57" name="void" size="0" align="8"/>
  <FundamentalType id="_58" name="double" size="64" align="64"/>
  <PointerType id="_59" type="_30" size="64" align="64"/>
  <ReferenceType id="_60" type="_21" size="64" align="64"/>
  <ReferenceType id="_61" type="_21c" size="64" align="64"/>
  <CvQualifiedType id="_21c" type="_21" const="1"/>
  <ReferenceType id="_62" type="_22c" size="64" align="64"/>
  <CvQualifiedType id="_22c" type="_22" const="1"/>
  <ReferenceType id="_63" type="_22" size="64" align="64"/>
  <FundamentalType id="_64" name="unsigned int" size="32" align="32"/>
  <PointerType id="_65" type="_57" size="64" align="64"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="test/test.hpp"/>
</CastXML>
