<?xml version="1.0"?>
<CastXML format="1.4.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9"/>
  <Typedef id="_2" name="__int128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="Bar" context="_1" location="f1:1" file="f1" line="1" members="_15 _16 _17 _18 _19 _20 _21" size="32" align="32"/>
  <Namespace id="_8" name="Foo" context="_1" members="_22 _23 _24"/>
  <Function id="_9" name="sum" returns="_25" context="_1" location="f1:33" file="f1" line="33" mangled="_Z3sumff">
    <Argument name="a" type="_25" location="f1:33" file="f1" line="33"/>
    <Argument name="b" type="_25" location="f1:33" file="f1" line="33"/>
  </Function>
  <FundamentalType id="_10" name="__int128" size="128" align="128"/>
  <FundamentalType id="_11" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_12" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_26 _27 _28 _29" size="256" align="64"/>
  <PointerType id="_13" type="_30" size="64" align="64"/>
  <ArrayType id="_14" min="0" max="0" type="_31"/>
  <Field id="_15" name="_3" type="_32" context="_7" access="public" location="f1:2" file="f1" line="2" offset="0"/>
  <Constructor id="_16" name="Bar" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_17" name="Bar" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_33" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_18" name="=" returns="_34" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="_ZN3BaraSERKS_">
    <Argument type="_33" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Constructor id="_19" name="Bar" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_35" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_20" name="=" returns="_34" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="_ZN3BaraSEOS_">
    <Argument type="_35" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_21" name="Bar" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Class id="_22" name="Test&lt;Bar&gt;" context="_8" location="f1:8" file="f1" line="8" members="_36 _37 _38 _39 _40 _41 _42 _43 _44 _45" size="256" align="64"/>
  <Class id="_23" name="Test2" context="_8" location="f1:22" file="f1" line="22" members="_46 _47 _48 _49 _50" bases="_22" size="256" align="64">
    <Base type="_22" access="public" virtual="0" offset="0"/>
  </Class>
  <Function id="_24" name="sum" returns="_25" context="_8" location="f1:29" file="f1" line="29" mangled="_ZN3Foo3sumEff">
    <Argument name="a" type="_25" location="f1:29" file="f1" line="29"/>
    <Argument name="b" type="_25" location="f1:29" file="f1" line="29"/>
  </Function>
  <FundamentalType id="_25" name="float" size="32" align="32"/>
  <Field id="_26" name="isa" type="_51" context="_12" access="public" offset="0"/>
  <Field id="_27" name="flags" type="_32" context="_12" access="public" offset="64"/>
  <Field id="_28" name="str" type="_52" context="_12" access="public" offset="128"/>
  <Field id="_29" name="length" type="_53" context="_12" access="public" offset="192"/>
  <Struct id="_31" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_54 _55 _56 _57" size="192" align="64"/>
  <FundamentalType id="_32" name="int" size="32" align="32"/>
  <ReferenceType id="_33" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_34" type="_7" size="64" align="64"/>
  <RValueReferenceType id="_35" type="_7" size="64" align="64"/>
  <Method id="_36" name="testingFunction" returns="_58" context="_22" access="public" location="f1:10" file="f1" line="10" virtual="1" mangled="_ZN3Foo4TestI3BarE15testingFunctionEd">
    <Argument name="delta" type="_59" location="f1:10" file="f1" line="10"/>
  </Method>
  <Field id="_37" name="testingItem" type="_32" context="_22" access="public" location="f1:12" file="f1" line="12" offset="64"/>
  <Field id="_38" name="testingptr" type="_60" context="_22" access="public" location="f1:13" file="f1" line="13" offset="128"/>
  <Field id="_39" name="testingChar" type="_30" context="_22" access="public" location="f1:14" file="f1" line="14" offset="192"/>
  <FundamentalType id="_30" name="char" size="8" align="8"/>
  <Destructor id="_40" name="Test" context="_22" access="public" location="f1:16" file="f1" line="16" virtual="1"/>
  <Method id="_41" name="test" returns="_58" context="_22" access="public" location="f1:17" file="f1" line="17" const="1" mangled="_ZNK3Foo4TestI3BarE4testEv"/>
  <Constructor id="_42" name="Test" context="_22" access="public" location="f1:19" file="f1" line="19"/>
  <Constructor id="_43" name="Test" context="_22" access="public" location="f1:20" file="f1" line="20">
    <Argument name="i" type="_32" location="f1:20" file="f1" line="20"/>
  </Constructor>
  <OperatorMethod id="_44" name="=" returns="_61" context="_22" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1" mangled="_ZN3Foo4TestI3BarEaSERKS2_">
    <Argument type="_62" location="f1:8" file="f1" line="8"/>
  </OperatorMethod>
  <Constructor id="_45" name="Test" context="_22" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1">
    <Argument type="_62" location="f1:8" file="f1" line="8"/>
  </Constructor>
  <Method id="_46" name="testingFunction" returns="_58" context="_23" access="public" location="f1:24" file="f1" line="24" virtual="1" overrides="_36" mangled="_ZN3Foo5Test215testingFunctionEd" attributes="override">
    <Argument name="delta" type="_59" location="f1:24" file="f1" line="24"/>
  </Method>
  <Constructor id="_47" name="Test2" context="_23" access="public" location="f1:25" file="f1" line="25"/>
  <Destructor id="_48" name="Test2" context="_23" access="public" location="f1:26" file="f1" line="26" virtual="1" overrides="_40"/>
  <Constructor id="_49" name="Test2" context="_23" access="public" location="f1:22" file="f1" line="22" inline="1" artificial="1">
    <Argument type="_63" location="f1:22" file="f1" line="22"/>
  </Constructor>
  <OperatorMethod id="_50" name="=" returns="_64" context="_23" access="public" location="f1:22" file="f1" line="22" inline="1" artificial="1" mangled="_ZN3Foo5Test2aSERKS0_">
    <Argument type="_63" location="f1:22" file="f1" line="22"/>
  </OperatorMethod>
  <PointerType id="_51" type="_32c" size="64" align="64"/>
  <CvQualifiedType id="_32c" type="_32" const="1"/>
  <PointerType id="_52" type="_30c" size="64" align="64"/>
  <CvQualifiedType id="_30c" type="_30" const="1"/>
  <FundamentalType id="_53" name="long int" size="64" align="64"/>
  <Field id="_54" name="gp_offset" type="_65" context="_31" access="public" offset="0"/>
  <Field id="_55" name="fp_offset" type="_65" context="_31" access="public" offset="32"/>
  <Field id="_56" name="overflow_arg_area" type="_66" context="_31" access="public" offset="64"/>
  <Field id="_57" name="reg_save_area" type="_66" context="_31" access="public" offset="128"/>
  <FundamentalType id="_58" name="void" size="0" align="8"/>
  <FundamentalType id="_59" name="double" size="64" align="64"/>
  <PointerType id="_60" type="_32" size="64" align="64"/>
  <ReferenceType id="_61" type="_22" size="64" align="64"/>
  <ReferenceType id="_62" type="_22c" size="64" align="64"/>
  <CvQualifiedType id="_22c" type="_22" const="1"/>
  <ReferenceType id="_63" type="_23c" size="64" align="64"/>
  <CvQualifiedType id="_23c" type="_23" const="1"/>
  <ReferenceType id="_64" type="_23" size="64" align="64"/>
  <FundamentalType id="_65" name="unsigned int" size="32" align="32"/>
  <PointerType id="_66" type="_58" size="64" align="64"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="test/test.hpp"/>
</CastXML>
