<?xml version="1.0"?>
<CastXML format="1.4.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21"/>
  <Typedef id="_2" name="__int128_t" type="_22" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_23" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_24" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_25" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_26" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_7" name="Test" context="_1" location="f1:1" file="f1" line="1" members="_27 _28 _29 _30 _31 _32 _33 _34" size="256" align="64"/>
  <Namespace id="_8" name="std" context="_1"/>
  <OperatorFunction id="_9" name="new" returns="_35" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_Znwm">
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_10" name="new" returns="_35" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZnwmSt11align_val_t">
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_11" name="new[]" returns="_35" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_Znam">
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_12" name="new[]" returns="_35" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZnamSt11align_val_t">
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_13" name="delete" returns="_38" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPv">
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_14" name="delete" returns="_38" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPvSt11align_val_t">
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_15" name="delete" returns="_38" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPvm">
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_16" name="delete" returns="_38" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPvmSt11align_val_t">
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_17" name="delete[]" returns="_38" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPv">
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_18" name="delete[]" returns="_38" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPvSt11align_val_t">
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_19" name="delete[]" returns="_38" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPvm">
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_20" name="delete[]" returns="_38" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPvmSt11align_val_t">
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <Class id="_21" name="Test2" context="_1" location="f1:13" file="f1" line="13" members="_39 _40 _41 _42 _43" bases="_7" size="256" align="64">
    <Base type="_7" access="public" virtual="0" offset="0"/>
  </Class>
  <FundamentalType id="_22" name="__int128" size="128" align="128"/>
  <FundamentalType id="_23" name="unsiged __int128" size="128" align="128"/>
  <Struct id="_24" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_44 _45 _46 _47" size="256" align="64"/>
  <PointerType id="_25" type="_48" size="64" align="64"/>
  <ArrayType id="_26" min="0" max="0" type="_49"/>
  <Method id="_27" name="testingFunction" returns="_38" context="_7" access="public" location="f1:3" file="f1" line="3" virtual="1" inline="1" mangled="_ZN4Test15testingFunctionEv"/>
  <Field id="_28" name="testingItem" type="_50" context="_7" access="public" location="f1:5" file="f1" line="5" offset="64"/>
  <Field id="_29" name="testingptr" type="_51" context="_7" access="public" location="f1:6" file="f1" line="6" offset="128"/>
  <Field id="_30" name="testingChar" type="_48" context="_7" access="public" location="f1:7" file="f1" line="7" offset="192"/>
  <Constructor id="_31" name="Test" context="_7" access="public" location="f1:9" file="f1" line="9" inline="1"/>
  <Destructor id="_32" name="Test" context="_7" access="public" location="f1:10" file="f1" line="10" virtual="1" inline="1"/>
  <OperatorMethod id="_33" name="=" returns="_52" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="_ZN4TestaSERKS_">
    <Argument type="_53" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Constructor id="_34" name="Test" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_53" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <PointerType id="_35" type="_38" size="64" align="64"/>
  <FundamentalType id="_36" name="long unsigned int" size="64" align="64"/>
  <Enumeration id="_37" name="align_val_t" type="_36" context="_8" location="f0:0" file="f0" line="0" scoped="1" size="64" align="64"/>
  <FundamentalType id="_38" name="void" size="0" align="8"/>
  <Method id="_39" name="test3" returns="_38" context="_21" access="private" location="f1:14" file="f1" line="14" virtual="1" inline="1" mangled="_ZN5Test25test3Ev"/>
  <Constructor id="_40" name="Test2" context="_21" access="private" location="f1:15" file="f1" line="15" inline="1"/>
  <Destructor id="_41" name="Test2" context="_21" access="private" location="f1:16" file="f1" line="16" virtual="1" inline="1" overrides="_32"/>
  <Constructor id="_42" name="Test2" context="_21" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1">
    <Argument type="_54" location="f1:13" file="f1" line="13"/>
  </Constructor>
  <OperatorMethod id="_43" name="=" returns="_55" context="_21" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1" mangled="_ZN5Test2aSERKS_">
    <Argument type="_54" location="f1:13" file="f1" line="13"/>
  </OperatorMethod>
  <Field id="_44" name="isa" type="_56" context="_24" access="public" offset="0"/>
  <Field id="_45" name="flags" type="_50" context="_24" access="public" offset="64"/>
  <Field id="_46" name="str" type="_57" context="_24" access="public" offset="128"/>
  <Field id="_47" name="length" type="_58" context="_24" access="public" offset="192"/>
  <FundamentalType id="_48" name="char" size="8" align="8"/>
  <Struct id="_49" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_59 _60 _61 _62" size="192" align="64"/>
  <FundamentalType id="_50" name="int" size="32" align="32"/>
  <PointerType id="_51" type="_50" size="64" align="64"/>
  <ReferenceType id="_52" type="_7" size="64" align="64"/>
  <ReferenceType id="_53" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_54" type="_21c" size="64" align="64"/>
  <CvQualifiedType id="_21c" type="_21" const="1"/>
  <ReferenceType id="_55" type="_21" size="64" align="64"/>
  <PointerType id="_56" type="_50c" size="64" align="64"/>
  <CvQualifiedType id="_50c" type="_50" const="1"/>
  <PointerType id="_57" type="_48c" size="64" align="64"/>
  <CvQualifiedType id="_48c" type="_48" const="1"/>
  <FundamentalType id="_58" name="long int" size="64" align="64"/>
  <Field id="_59" name="gp_offset" type="_63" context="_49" access="public" offset="0"/>
  <Field id="_60" name="fp_offset" type="_63" context="_49" access="public" offset="32"/>
  <Field id="_61" name="overflow_arg_area" type="_35" context="_49" access="public" offset="64"/>
  <Field id="_62" name="reg_save_area" type="_35" context="_49" access="public" offset="128"/>
  <FundamentalType id="_63" name="unsigned int" size="32" align="32"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="test.cpp"/>
</CastXML>
