<?xml version="1.0"?>
<CastXML format="1.4.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22"/>
  <Typedef id="_2" name="__int128_t" type="_23" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_24" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_25" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_26" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_27" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_7" name="Test" context="_1" location="f1:3" file="f1" line="3" members="_28 _29 _30 _31 _32 _33 _34 _35 _36" size="256" align="64"/>
  <Namespace id="_8" name="std" context="_1"/>
  <OperatorFunction id="_9" name="new" returns="_37" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_Znwm">
    <Argument type="_38" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_10" name="new" returns="_37" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZnwmSt11align_val_t">
    <Argument type="_38" location="f0:0" file="f0" line="0"/>
    <Argument type="_39" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_11" name="new[]" returns="_37" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_Znam">
    <Argument type="_38" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_12" name="new[]" returns="_37" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZnamSt11align_val_t">
    <Argument type="_38" location="f0:0" file="f0" line="0"/>
    <Argument type="_39" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_13" name="delete" returns="_40" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPv">
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_14" name="delete" returns="_40" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPvSt11align_val_t">
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
    <Argument type="_39" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_15" name="delete" returns="_40" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPvm">
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
    <Argument type="_38" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_16" name="delete" returns="_40" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPvmSt11align_val_t">
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
    <Argument type="_38" location="f0:0" file="f0" line="0"/>
    <Argument type="_39" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_17" name="delete[]" returns="_40" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPv">
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_18" name="delete[]" returns="_40" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPvSt11align_val_t">
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
    <Argument type="_39" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_19" name="delete[]" returns="_40" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPvm">
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
    <Argument type="_38" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_20" name="delete[]" returns="_40" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPvmSt11align_val_t">
    <Argument type="_37" location="f0:0" file="f0" line="0"/>
    <Argument type="_38" location="f0:0" file="f0" line="0"/>
    <Argument type="_39" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <Class id="_21" name="Test2" context="_1" location="f1:16" file="f1" line="16" members="_41 _42 _43 _44 _45" bases="_7" size="256" align="64">
    <Base type="_7" access="public" virtual="0" offset="0"/>
  </Class>
  <Function id="_22" name="sum" returns="_46" context="_1" location="f1:22" file="f1" line="22" mangled="_Z3sumff">
    <Argument name="a" type="_46" location="f1:22" file="f1" line="22"/>
    <Argument name="b" type="_46" location="f1:22" file="f1" line="22"/>
  </Function>
  <FundamentalType id="_23" name="__int128" size="128" align="128"/>
  <FundamentalType id="_24" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_25" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_47 _48 _49 _50" size="256" align="64"/>
  <PointerType id="_26" type="_51" size="64" align="64"/>
  <ArrayType id="_27" min="0" max="0" type="_52"/>
  <Method id="_28" name="testingFunction" returns="_40" context="_7" access="public" location="f1:5" file="f1" line="5" virtual="1" inline="1" mangled="_ZN4Test15testingFunctionEf">
    <Argument name="delta" type="_46" location="f1:5" file="f1" line="5"/>
  </Method>
  <Field id="_29" name="testingItem" type="_53" context="_7" access="public" location="f1:7" file="f1" line="7" offset="64"/>
  <Field id="_30" name="testingptr" type="_54" context="_7" access="public" location="f1:8" file="f1" line="8" offset="128"/>
  <Field id="_31" name="testingChar" type="_51" context="_7" access="public" location="f1:9" file="f1" line="9" offset="192"/>
  <Constructor id="_32" name="Test" context="_7" access="public" location="f1:11" file="f1" line="11" inline="1"/>
  <Destructor id="_33" name="Test" context="_7" access="public" location="f1:12" file="f1" line="12" virtual="1" inline="1"/>
  <Method id="_34" name="test" returns="_40" context="_7" access="public" location="f1:13" file="f1" line="13" inline="1" mangled="_ZN4Test4testEv"/>
  <OperatorMethod id="_35" name="=" returns="_55" context="_7" access="public" location="f1:3" file="f1" line="3" inline="1" artificial="1" mangled="_ZN4TestaSERKS_">
    <Argument type="_56" location="f1:3" file="f1" line="3"/>
  </OperatorMethod>
  <Constructor id="_36" name="Test" context="_7" access="public" location="f1:3" file="f1" line="3" inline="1" artificial="1">
    <Argument type="_56" location="f1:3" file="f1" line="3"/>
  </Constructor>
  <PointerType id="_37" type="_40" size="64" align="64"/>
  <FundamentalType id="_38" name="long unsigned int" size="64" align="64"/>
  <Enumeration id="_39" name="align_val_t" type="_38" context="_8" location="f0:0" file="f0" line="0" scoped="1" size="64" align="64"/>
  <FundamentalType id="_40" name="void" size="0" align="8"/>
  <Method id="_41" name="test3" returns="_40" context="_21" access="private" location="f1:17" file="f1" line="17" virtual="1" inline="1" mangled="_ZN5Test25test3Ef">
    <Argument name="delta" type="_46" location="f1:17" file="f1" line="17"/>
  </Method>
  <Constructor id="_42" name="Test2" context="_21" access="private" location="f1:18" file="f1" line="18" inline="1"/>
  <Destructor id="_43" name="Test2" context="_21" access="private" location="f1:19" file="f1" line="19" virtual="1" inline="1" overrides="_33"/>
  <Constructor id="_44" name="Test2" context="_21" access="public" location="f1:16" file="f1" line="16" inline="1" artificial="1">
    <Argument type="_57" location="f1:16" file="f1" line="16"/>
  </Constructor>
  <OperatorMethod id="_45" name="=" returns="_58" context="_21" access="public" location="f1:16" file="f1" line="16" inline="1" artificial="1" mangled="_ZN5Test2aSERKS_">
    <Argument type="_57" location="f1:16" file="f1" line="16"/>
  </OperatorMethod>
  <FundamentalType id="_46" name="float" size="32" align="32"/>
  <Field id="_47" name="isa" type="_59" context="_25" access="public" offset="0"/>
  <Field id="_48" name="flags" type="_53" context="_25" access="public" offset="64"/>
  <Field id="_49" name="str" type="_60" context="_25" access="public" offset="128"/>
  <Field id="_50" name="length" type="_61" context="_25" access="public" offset="192"/>
  <FundamentalType id="_51" name="char" size="8" align="8"/>
  <Struct id="_52" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_62 _63 _64 _65" size="192" align="64"/>
  <FundamentalType id="_53" name="int" size="32" align="32"/>
  <PointerType id="_54" type="_53" size="64" align="64"/>
  <ReferenceType id="_55" type="_7" size="64" align="64"/>
  <ReferenceType id="_56" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_57" type="_21c" size="64" align="64"/>
  <CvQualifiedType id="_21c" type="_21" const="1"/>
  <ReferenceType id="_58" type="_21" size="64" align="64"/>
  <PointerType id="_59" type="_53c" size="64" align="64"/>
  <CvQualifiedType id="_53c" type="_53" const="1"/>
  <PointerType id="_60" type="_51c" size="64" align="64"/>
  <CvQualifiedType id="_51c" type="_51" const="1"/>
  <FundamentalType id="_61" name="long int" size="64" align="64"/>
  <Field id="_62" name="gp_offset" type="_66" context="_52" access="public" offset="0"/>
  <Field id="_63" name="fp_offset" type="_66" context="_52" access="public" offset="32"/>
  <Field id="_64" name="overflow_arg_area" type="_37" context="_52" access="public" offset="64"/>
  <Field id="_65" name="reg_save_area" type="_37" context="_52" access="public" offset="128"/>
  <FundamentalType id="_66" name="unsigned int" size="32" align="32"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="test.cpp"/>
</CastXML>
