<?xml version="1.0"?>
<CastXML format="1.4.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9"/>
  <Typedef id="_2" name="__int128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="Bar" context="_1" location="f1:1" file="f1" line="1" members="_15" size="32" align="32"/>
  <Namespace id="_8" name="Foo" context="_1" members="_16 _17 _18 _19"/>
  <Function id="_9" name="sum" returns="_20" context="_1" location="f2:33" file="f2" line="33" mangled="_Z3sumff">
    <Argument name="a" type="_20" location="f2:33" file="f2" line="33"/>
    <Argument name="b" type="_20" location="f2:33" file="f2" line="33"/>
  </Function>
  <FundamentalType id="_10" name="__int128" size="128" align="128"/>
  <FundamentalType id="_11" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_12" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_21 _22 _23 _24" size="256" align="64"/>
  <PointerType id="_13" type="_25" size="64" align="64"/>
  <ArrayType id="_14" min="0" max="0" type="_26"/>
  <Field id="_15" name="_3" type="_27" context="_7" access="public" location="f1:2" file="f1" line="2" offset="0"/>
  <Class id="_16" name="Test&lt;Bar&gt;" context="_8" location="f1:8" file="f1" line="8" members="_28 _29 _30 _31 _32 _33 _34 _35 _36 _37" size="256" align="64"/>
  <Class id="_17" name="Test&lt;int&gt;" context="_8" location="f1:8" file="f1" line="8" incomplete="1"/>
  <Class id="_18" name="Test2" context="_8" location="f1:23" file="f1" line="23" members="_38 _39 _40 _41 _42" bases="_16" size="256" align="64">
    <Base type="_16" access="public" virtual="0" offset="0"/>
  </Class>
  <Function id="_19" name="sum" returns="_20" context="_8" location="f1:29" file="f1" line="29" mangled="_ZN3Foo3sumEff">
    <Argument name="a" type="_20" location="f1:29" file="f1" line="29"/>
    <Argument name="b" type="_20" location="f1:29" file="f1" line="29"/>
  </Function>
  <FundamentalType id="_20" name="float" size="32" align="32"/>
  <Field id="_21" name="isa" type="_43" context="_12" access="public" offset="0"/>
  <Field id="_22" name="flags" type="_27" context="_12" access="public" offset="64"/>
  <Field id="_23" name="str" type="_44" context="_12" access="public" offset="128"/>
  <Field id="_24" name="length" type="_45" context="_12" access="public" offset="192"/>
  <Struct id="_26" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_46 _47 _48 _49" size="192" align="64"/>
  <FundamentalType id="_27" name="int" size="32" align="32"/>
  <Method id="_28" name="testingFunction" returns="_50" context="_16" access="public" location="f1:10" file="f1" line="10" virtual="1" mangled="_ZN3Foo4TestI3BarE15testingFunctionEf">
    <Argument name="delta" type="_20" location="f1:10" file="f1" line="10"/>
  </Method>
  <Field id="_29" name="testingItem" type="_27" context="_16" access="public" location="f1:12" file="f1" line="12" offset="64"/>
  <Field id="_30" name="testingptr" type="_51" context="_16" access="public" location="f1:13" file="f1" line="13" offset="128"/>
  <Field id="_31" name="testingChar" type="_25" context="_16" access="public" location="f1:14" file="f1" line="14" offset="192"/>
  <FundamentalType id="_25" name="char" size="8" align="8"/>
  <Destructor id="_32" name="Test" context="_16" access="public" location="f1:16" file="f1" line="16"/>
  <Method id="_33" name="test" returns="_50" context="_16" access="public" location="f1:17" file="f1" line="17" const="1" mangled="_ZNK3Foo4TestI3BarE4testEv"/>
  <Constructor id="_34" name="Test" context="_16" access="public" location="f1:19" file="f1" line="19"/>
  <Constructor id="_35" name="Test" context="_16" access="public" location="f1:20" file="f1" line="20">
    <Argument name="i" type="_27" location="f1:20" file="f1" line="20"/>
  </Constructor>
  <OperatorMethod id="_36" name="=" returns="_52" context="_16" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1" mangled="_ZN3Foo4TestI3BarEaSERKS2_">
    <Argument type="_53" location="f1:8" file="f1" line="8"/>
  </OperatorMethod>
  <Constructor id="_37" name="Test" context="_16" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1">
    <Argument type="_53" location="f1:8" file="f1" line="8"/>
  </Constructor>
  <Method id="_38" name="testingFunction" returns="_50" context="_18" access="private" location="f1:24" file="f1" line="24" virtual="1" overrides="_28" mangled="_ZN3Foo5Test215testingFunctionEf" attributes="override">
    <Argument name="delta" type="_20" location="f1:24" file="f1" line="24"/>
  </Method>
  <Constructor id="_39" name="Test2" context="_18" access="private" location="f1:25" file="f1" line="25"/>
  <Destructor id="_40" name="Test2" context="_18" access="private" location="f1:26" file="f1" line="26"/>
  <Constructor id="_41" name="Test2" context="_18" access="public" location="f1:23" file="f1" line="23" inline="1" artificial="1">
    <Argument type="_54" location="f1:23" file="f1" line="23"/>
  </Constructor>
  <OperatorMethod id="_42" name="=" returns="_55" context="_18" access="public" location="f1:23" file="f1" line="23" inline="1" artificial="1" mangled="_ZN3Foo5Test2aSERKS0_">
    <Argument type="_54" location="f1:23" file="f1" line="23"/>
  </OperatorMethod>
  <PointerType id="_43" type="_27c" size="64" align="64"/>
  <CvQualifiedType id="_27c" type="_27" const="1"/>
  <PointerType id="_44" type="_25c" size="64" align="64"/>
  <CvQualifiedType id="_25c" type="_25" const="1"/>
  <FundamentalType id="_45" name="long int" size="64" align="64"/>
  <Field id="_46" name="gp_offset" type="_56" context="_26" access="public" offset="0"/>
  <Field id="_47" name="fp_offset" type="_56" context="_26" access="public" offset="32"/>
  <Field id="_48" name="overflow_arg_area" type="_57" context="_26" access="public" offset="64"/>
  <Field id="_49" name="reg_save_area" type="_57" context="_26" access="public" offset="128"/>
  <FundamentalType id="_50" name="void" size="0" align="8"/>
  <PointerType id="_51" type="_27" size="64" align="64"/>
  <ReferenceType id="_52" type="_16" size="64" align="64"/>
  <ReferenceType id="_53" type="_16c" size="64" align="64"/>
  <CvQualifiedType id="_16c" type="_16" const="1"/>
  <ReferenceType id="_54" type="_18c" size="64" align="64"/>
  <CvQualifiedType id="_18c" type="_18" const="1"/>
  <ReferenceType id="_55" type="_18" size="64" align="64"/>
  <FundamentalType id="_56" name="unsigned int" size="32" align="32"/>
  <PointerType id="_57" type="_50" size="64" align="64"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="./test/test.hpp"/>
  <File id="f2" name="./test/test.cpp"/>
</CastXML>
