<?xml version="1.0"?>
<CastXML format="1.4.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9"/>
  <Typedef id="_2" name="__int128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_7" name="Test" context="_1" location="f1:3" file="f1" line="3" members="_15 _16 _17 _18 _19 _20 _21 _22 _23" size="256" align="64"/>
  <Class id="_8" name="Test2" context="_1" location="f1:16" file="f1" line="16" members="_24 _25 _26 _27 _28" bases="_7" size="256" align="64">
    <Base type="_7" access="public" virtual="0" offset="0"/>
  </Class>
  <Function id="_9" name="sum" returns="_29" context="_1" location="f1:22" file="f1" line="22" mangled="_Z3sumff">
    <Argument name="a" type="_29" location="f1:22" file="f1" line="22"/>
    <Argument name="b" type="_29" location="f1:22" file="f1" line="22"/>
  </Function>
  <FundamentalType id="_10" name="__int128" size="128" align="128"/>
  <FundamentalType id="_11" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_12" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_30 _31 _32 _33" size="256" align="64"/>
  <PointerType id="_13" type="_34" size="64" align="64"/>
  <ArrayType id="_14" min="0" max="0" type="_35"/>
  <Method id="_15" name="testingFunction" returns="_36" context="_7" access="public" location="f1:5" file="f1" line="5" virtual="1" mangled="_ZN4Test15testingFunctionEf">
    <Argument name="delta" type="_29" location="f1:5" file="f1" line="5"/>
  </Method>
  <Field id="_16" name="testingItem" type="_37" context="_7" access="public" location="f1:7" file="f1" line="7" offset="64"/>
  <Field id="_17" name="testingptr" type="_38" context="_7" access="public" location="f1:8" file="f1" line="8" offset="128"/>
  <Field id="_18" name="testingChar" type="_34" context="_7" access="public" location="f1:9" file="f1" line="9" offset="192"/>
  <Constructor id="_19" name="Test" context="_7" access="public" location="f1:11" file="f1" line="11"/>
  <Destructor id="_20" name="Test" context="_7" access="public" location="f1:12" file="f1" line="12" virtual="1"/>
  <Method id="_21" name="test" returns="_36" context="_7" access="public" location="f1:13" file="f1" line="13" const="1" mangled="_ZNK4Test4testEv"/>
  <OperatorMethod id="_22" name="=" returns="_39" context="_7" access="public" location="f1:3" file="f1" line="3" inline="1" artificial="1" mangled="_ZN4TestaSERKS_">
    <Argument type="_40" location="f1:3" file="f1" line="3"/>
  </OperatorMethod>
  <Constructor id="_23" name="Test" context="_7" access="public" location="f1:3" file="f1" line="3" inline="1" artificial="1">
    <Argument type="_40" location="f1:3" file="f1" line="3"/>
  </Constructor>
  <Method id="_24" name="testingFunction" returns="_36" context="_8" access="private" location="f1:17" file="f1" line="17" virtual="1" overrides="_15" mangled="_ZN5Test215testingFunctionEf" attributes="override">
    <Argument name="delta" type="_29" location="f1:17" file="f1" line="17"/>
  </Method>
  <Constructor id="_25" name="Test2" context="_8" access="private" location="f1:18" file="f1" line="18"/>
  <Destructor id="_26" name="Test2" context="_8" access="private" location="f1:19" file="f1" line="19" virtual="1" overrides="_20"/>
  <Constructor id="_27" name="Test2" context="_8" access="public" location="f1:16" file="f1" line="16" inline="1" artificial="1">
    <Argument type="_41" location="f1:16" file="f1" line="16"/>
  </Constructor>
  <OperatorMethod id="_28" name="=" returns="_42" context="_8" access="public" location="f1:16" file="f1" line="16" inline="1" artificial="1" mangled="_ZN5Test2aSERKS_">
    <Argument type="_41" location="f1:16" file="f1" line="16"/>
  </OperatorMethod>
  <FundamentalType id="_29" name="float" size="32" align="32"/>
  <Field id="_30" name="isa" type="_43" context="_12" access="public" offset="0"/>
  <Field id="_31" name="flags" type="_37" context="_12" access="public" offset="64"/>
  <Field id="_32" name="str" type="_44" context="_12" access="public" offset="128"/>
  <Field id="_33" name="length" type="_45" context="_12" access="public" offset="192"/>
  <FundamentalType id="_34" name="char" size="8" align="8"/>
  <Struct id="_35" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_46 _47 _48 _49" size="192" align="64"/>
  <FundamentalType id="_36" name="void" size="0" align="8"/>
  <FundamentalType id="_37" name="int" size="32" align="32"/>
  <PointerType id="_38" type="_37" size="64" align="64"/>
  <ReferenceType id="_39" type="_7" size="64" align="64"/>
  <ReferenceType id="_40" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_41" type="_8c" size="64" align="64"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <ReferenceType id="_42" type="_8" size="64" align="64"/>
  <PointerType id="_43" type="_37c" size="64" align="64"/>
  <CvQualifiedType id="_37c" type="_37" const="1"/>
  <PointerType id="_44" type="_34c" size="64" align="64"/>
  <CvQualifiedType id="_34c" type="_34" const="1"/>
  <FundamentalType id="_45" name="long int" size="64" align="64"/>
  <Field id="_46" name="gp_offset" type="_50" context="_35" access="public" offset="0"/>
  <Field id="_47" name="fp_offset" type="_50" context="_35" access="public" offset="32"/>
  <Field id="_48" name="overflow_arg_area" type="_51" context="_35" access="public" offset="64"/>
  <Field id="_49" name="reg_save_area" type="_51" context="_35" access="public" offset="128"/>
  <FundamentalType id="_50" name="unsigned int" size="32" align="32"/>
  <PointerType id="_51" type="_36" size="64" align="64"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="./test/test.hpp"/>
</CastXML>
