<?xml version="1.0"?>
<CastXML format="1.4.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23"/>
  <Typedef id="_2" name="__int128_t" type="_24" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_25" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_26" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_27" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_28" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="Bar" context="_1" location="f1:1" file="f1" line="1" members="_29" size="32" align="32"/>
  <Namespace id="_8" name="Foo" context="_1" members="_30 _31 _32 _33"/>
  <Namespace id="_9" name="std" context="_1"/>
  <OperatorFunction id="_10" name="new" returns="_34" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_Znwm">
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_11" name="new" returns="_34" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZnwmSt11align_val_t">
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_12" name="new[]" returns="_34" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_Znam">
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_13" name="new[]" returns="_34" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZnamSt11align_val_t">
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_14" name="delete" returns="_37" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPv">
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_15" name="delete" returns="_37" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPvSt11align_val_t">
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_16" name="delete" returns="_37" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPvm">
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_17" name="delete" returns="_37" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdlPvmSt11align_val_t">
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_18" name="delete[]" returns="_37" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPv">
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_19" name="delete[]" returns="_37" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPvSt11align_val_t">
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_20" name="delete[]" returns="_37" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPvm">
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <OperatorFunction id="_21" name="delete[]" returns="_37" context="_1" location="f0:0" file="f0" line="0" artificial="1" mangled="_ZdaPvmSt11align_val_t">
    <Argument type="_34" location="f0:0" file="f0" line="0"/>
    <Argument type="_35" location="f0:0" file="f0" line="0"/>
    <Argument type="_36" location="f0:0" file="f0" line="0"/>
  </OperatorFunction>
  <Function id="_22" name="sum" returns="_38" context="_1" location="f2:37" file="f2" line="37" mangled="_Z3sumff">
    <Argument name="a" type="_38" location="f2:37" file="f2" line="37"/>
    <Argument name="b" type="_38" location="f2:37" file="f2" line="37"/>
  </Function>
  <Typedef id="_23" name="TestInt" type="_31" context="_1" location="f2:41" file="f2" line="41"/>
  <FundamentalType id="_24" name="__int128" size="128" align="128"/>
  <FundamentalType id="_25" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_26" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_39 _40 _41 _42" size="256" align="64"/>
  <PointerType id="_27" type="_43" size="64" align="64"/>
  <ArrayType id="_28" min="0" max="0" type="_44"/>
  <Field id="_29" name="_3" type="_45" context="_7" access="public" location="f1:2" file="f1" line="2" offset="0"/>
  <Class id="_30" name="Test&lt;Bar&gt;" context="_8" location="f1:8" file="f1" line="8" members="_46 _47 _48 _49 _50 _51 _52 _53 _54 _55" size="256" align="64"/>
  <Class id="_31" name="Test&lt;int&gt;" context="_8" location="f1:8" file="f1" line="8" incomplete="1"/>
  <Class id="_32" name="Test2" context="_8" location="f1:23" file="f1" line="23" members="_56 _57 _58 _59 _60" bases="_30" size="256" align="64">
    <Base type="_30" access="public" virtual="0" offset="0"/>
  </Class>
  <Function id="_33" name="sum" returns="_38" context="_8" location="f1:29" file="f1" line="29" mangled="_ZN3Foo3sumEff">
    <Argument name="a" type="_38" location="f1:29" file="f1" line="29"/>
    <Argument name="b" type="_38" location="f1:29" file="f1" line="29"/>
  </Function>
  <PointerType id="_34" type="_37" size="64" align="64"/>
  <FundamentalType id="_35" name="long unsigned int" size="64" align="64"/>
  <Enumeration id="_36" name="align_val_t" type="_35" context="_9" location="f0:0" file="f0" line="0" scoped="1" size="64" align="64"/>
  <FundamentalType id="_37" name="void" size="0" align="8"/>
  <FundamentalType id="_38" name="float" size="32" align="32"/>
  <Field id="_39" name="isa" type="_61" context="_26" access="public" offset="0"/>
  <Field id="_40" name="flags" type="_45" context="_26" access="public" offset="64"/>
  <Field id="_41" name="str" type="_62" context="_26" access="public" offset="128"/>
  <Field id="_42" name="length" type="_63" context="_26" access="public" offset="192"/>
  <Struct id="_44" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_64 _65 _66 _67" size="192" align="64"/>
  <FundamentalType id="_45" name="int" size="32" align="32"/>
  <Method id="_46" name="testingFunction" returns="_37" context="_30" access="public" location="f1:10" file="f1" line="10" virtual="1" mangled="_ZN3Foo4TestI3BarE15testingFunctionEf">
    <Argument name="delta" type="_38" location="f1:10" file="f1" line="10"/>
  </Method>
  <Field id="_47" name="testingItem" type="_45" context="_30" access="public" location="f1:12" file="f1" line="12" offset="64"/>
  <Field id="_48" name="testingptr" type="_68" context="_30" access="public" location="f1:13" file="f1" line="13" offset="128"/>
  <Field id="_49" name="testingChar" type="_43" context="_30" access="public" location="f1:14" file="f1" line="14" offset="192"/>
  <FundamentalType id="_43" name="char" size="8" align="8"/>
  <Destructor id="_50" name="Test" context="_30" access="public" location="f1:16" file="f1" line="16" virtual="1"/>
  <Method id="_51" name="test" returns="_37" context="_30" access="public" location="f1:17" file="f1" line="17" const="1" mangled="_ZNK3Foo4TestI3BarE4testEv"/>
  <Constructor id="_52" name="Test" context="_30" access="public" location="f1:19" file="f1" line="19"/>
  <Constructor id="_53" name="Test" context="_30" access="public" location="f1:20" file="f1" line="20">
    <Argument name="i" type="_45" location="f1:20" file="f1" line="20"/>
  </Constructor>
  <OperatorMethod id="_54" name="=" returns="_69" context="_30" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1" mangled="_ZN3Foo4TestI3BarEaSERKS2_">
    <Argument type="_70" location="f1:8" file="f1" line="8"/>
  </OperatorMethod>
  <Constructor id="_55" name="Test" context="_30" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1">
    <Argument type="_70" location="f1:8" file="f1" line="8"/>
  </Constructor>
  <Method id="_56" name="testingFunction" returns="_37" context="_32" access="private" location="f1:24" file="f1" line="24" virtual="1" overrides="_46" mangled="_ZN3Foo5Test215testingFunctionEf" attributes="override">
    <Argument name="delta" type="_38" location="f1:24" file="f1" line="24"/>
  </Method>
  <Constructor id="_57" name="Test2" context="_32" access="private" location="f1:25" file="f1" line="25"/>
  <Destructor id="_58" name="Test2" context="_32" access="private" location="f1:26" file="f1" line="26" virtual="1" overrides="_50"/>
  <Constructor id="_59" name="Test2" context="_32" access="public" location="f1:23" file="f1" line="23" inline="1" artificial="1">
    <Argument type="_71" location="f1:23" file="f1" line="23"/>
  </Constructor>
  <OperatorMethod id="_60" name="=" returns="_72" context="_32" access="public" location="f1:23" file="f1" line="23" inline="1" artificial="1" mangled="_ZN3Foo5Test2aSERKS0_">
    <Argument type="_71" location="f1:23" file="f1" line="23"/>
  </OperatorMethod>
  <PointerType id="_61" type="_45c" size="64" align="64"/>
  <CvQualifiedType id="_45c" type="_45" const="1"/>
  <PointerType id="_62" type="_43c" size="64" align="64"/>
  <CvQualifiedType id="_43c" type="_43" const="1"/>
  <FundamentalType id="_63" name="long int" size="64" align="64"/>
  <Field id="_64" name="gp_offset" type="_73" context="_44" access="public" offset="0"/>
  <Field id="_65" name="fp_offset" type="_73" context="_44" access="public" offset="32"/>
  <Field id="_66" name="overflow_arg_area" type="_34" context="_44" access="public" offset="64"/>
  <Field id="_67" name="reg_save_area" type="_34" context="_44" access="public" offset="128"/>
  <PointerType id="_68" type="_45" size="64" align="64"/>
  <ReferenceType id="_69" type="_30" size="64" align="64"/>
  <ReferenceType id="_70" type="_30c" size="64" align="64"/>
  <CvQualifiedType id="_30c" type="_30" const="1"/>
  <ReferenceType id="_71" type="_32c" size="64" align="64"/>
  <CvQualifiedType id="_32c" type="_32" const="1"/>
  <ReferenceType id="_72" type="_32" size="64" align="64"/>
  <FundamentalType id="_73" name="unsigned int" size="32" align="32"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="test/test.hpp"/>
  <File id="f2" name="test/test.cpp"/>
</CastXML>
